Конфигурация/Reports/РегламентированныйОтчетБаланс.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>РегламентированныйОтчетБаланс</Name>
		</Properties>
	</Report>
</MetaDataObject>

Конфигурация/InformationRegisters/РеквизитыЮридическихЛицАнкетные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>РеквизитыЮридическихЛицАнкетные</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КраткоеНаименованиеПоУставу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолноеНаименованиеПоУставу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СокращенноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КППКрупнейшегоНалогоплательщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОрганизационноПравоваяФорма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОрганизационноПравовыеФормы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>350</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКПО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКТМО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКАТО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОГРН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыдачиОГРН</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОрганВыдавшийОГРН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезидентРФ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>TIN</Name>
					<Comment>Taxpayer Identification Number</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КИО</Name>
					<Comment>Код иностранной организации</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтранаРегистрации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЮридическийАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЮридическийАдресФИАС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФактическийАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФактическийАдресФИАС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПочтовыйАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПочтовыйАдресФИАС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>EMail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Телефоны</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Факсы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВебСтраница</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезидентПо173ФЗ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестоНахождения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МеждународнаяКомпания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособСозданияМеждународнойКомпании</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыСозданияМеждународнойКомпании</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Язык</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Языки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/СтатистикаРаботыВнутреннихМеханизмов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СтатистикаРаботыВнутреннихМеханизмов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПериодВыполненияНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодВыполненияОкончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодВыполненияНачалоМС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодВыполненияОкончаниеМС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПараметрыВыполнения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сеанс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СессияЗавершенаСОшибкой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Механизм</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сессия</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачалаВыполнения</Name>
					<Comment>Должна соответствовать дате из ПериодВыполненияНачало. Служит для групповой обработки записей</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/РеформацииБалансов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>РеформацииБалансов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаРеформации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/СтандартыФинансовойОтчетности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СтандартыФинансовойОтчетности</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>МСФО9</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МСФО39</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Reports/РегламентированныйОтчетБаланс/Forms/ОсновнаяФорма/Ext/Form/Module.bsl
&НаКлиентеНаСервереБезКонтекста
Процедура ИзменитьПериод(Форма, Шаг)
	
	Форма.мДатаКонцаПериодаОтчета  = КонецМесяца(ДобавитьМесяц(Форма.мДатаКонцаПериодаОтчета, Шаг));
	Форма.мДатаНачалаПериодаОтчета = НачалоГода(Форма.мДатаКонцаПериодаОтчета); 
	УстановитьПризнакПереходаМСФО9(Форма);
	
КонецПроцедуры

&НаСервере
Процедура ОткорректироватьНачальныйПериод(ВыбОрганизация)
	
	Если НЕ ЗначениеЗаполнено(мДатаНачалаПериодаОтчета) ИЛИ НЕ ЗначениеЗаполнено(мДатаКонцаПериодаОтчета) Тогда
		мДатаКонцаПериодаОтчета = КонецКвартала(ДобавитьМесяц(КонецКвартала(ТекущаяДатаСеанса()), -3));
		мДатаНачалаПериодаОтчета = НачалоГода(мДатаКонцаПериодаОтчета);
	КонецЕсли;
	
	ДатаРегистрации = НачалоДня(ВыбОрганизация.ДатаНачалаУчета);
	
	Если мДатаКонцаПериодаОтчета < ДатаРегистрации Тогда
		// Период предшествует дате регистрации.
		мДатаКонцаПериодаОтчета = КонецКвартала(ДатаРегистрации);
		мДатаНачалаПериодаОтчета = ДатаРегистрации;
	ИначеЕсли мДатаНачалаПериодаОтчета <= ДатаРегистрации И ДатаРегистрации <= мДатаКонцаПериодаОтчета Тогда
		// Период содержит дату регистрации.
		мДатаНачалаПериодаОтчета = НачалоГода(ДатаРегистрации);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВариантУчетаСтоимостиИОбесцененияФинансовыхАктивов(Организация, СчетДоверительногоУправления, ДатаПроверки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиУчетаОбщиеСрезПоследних.ВариантУчетаСтоимостиИОбесцененияФинансовыхАктивов КАК ВариантУчетаСтоимостиИОбесцененияФинансовыхАктивов
		|ИЗ
		|	РегистрСведений.НастройкиУчетаОбщие.СрезПоследних(
		|			&ДатаПроверки,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК НастройкиУчетаОбщиеСрезПоследних";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ДатаПроверки", ДатаПроверки); 
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Если Выборка.Следующий() Тогда  
		Возврат Выборка.ВариантУчетаСтоимостиИОбесцененияФинансовыхАктивов;  
	Иначе
		Возврат Неопределено;
	КонецЕсли;  
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьКнопокПериода(Форма, ОргДатаРегистрации);
	
	ВидПериода = КонсолидированнаяОтчетностьКлиентСервер.ВидПериодаОтчета(Форма, ОргДатаРегистрации);
	
	Если ВидПериода = "Нестандартный" Тогда
		Форма.Элементы.УстановитьПредыдущийПериод.Доступность = Ложь;
		Форма.Элементы.УстановитьСледующийПериод.Доступность = Ложь;
	ИначеЕсли ВидПериода = "Сокращенный" Тогда
		Форма.Элементы.УстановитьСледующийПериод.Доступность = Истина;
		Если КонецМесяца(Форма.мДатаКонцаПериодаОтчета) <= КонецМесяца(Форма.мДатаНачалаПериодаОтчета) Тогда
			Форма.Элементы.УстановитьПредыдущийПериод.Доступность = Ложь;
		Иначе
			Форма.Элементы.УстановитьПредыдущийПериод.Доступность = Истина;
		КонецЕсли;
	Иначе
		Форма.Элементы.УстановитьПредыдущийПериод.Доступность = Истина;
		Форма.Элементы.УстановитьСледующийПериод.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("НастройкиОтчета", ЭтаФорма.НастройкиОтчета) Тогда
		
		ЭтаФорма.Организация             		= ЭтаФорма.НастройкиОтчета.Организация;
		ЭтаФорма.СчетДоверительногоУправления	= ЭтаФорма.НастройкиОтчета.СчетДоверительногоУправления;
		ЭтаФорма.мДатаНачалаПериодаОтчета 		= ЭтаФорма.НастройкиОтчета.Период.ДатаНачала;
		ЭтаФорма.мДатаКонцаПериодаОтчета  		= ЭтаФорма.НастройкиОтчета.Период.ДатаОкончания;
		ЭтаФорма.мСохраненныйДок          		= ЭтаФорма.НастройкиОтчета.РегламентированныйОтчет;
		ЭтаФорма.мВыбраннаяФорма          		= ЭтаФорма.НастройкиОтчета.ВыбраннаяФорма;
		ЭтаФорма.ВидДеятельностиОрганизации		= ЭтаФорма.НастройкиОтчета.ВидДеятельностиОрганизации;
		ЭтаФорма.НКО          					= ЭтаФорма.НастройкиОтчета.НКО;
		
		УстановитьПереключательВидаДеятельностиИФормыОрганизации(ЭтаФорма);

	Иначе
		
		ЭтаФорма.Организация             		= Параметры.Организация;
		ЭтаФорма.СчетДоверительногоУправления	= Параметры.СчетДоверительногоУправления;
		ЭтаФорма.мДатаНачалаПериодаОтчета 		= Параметры.мДатаНачалаПериодаОтчета;
		ЭтаФорма.мДатаКонцаПериодаОтчета  		= Параметры.мДатаКонцаПериодаОтчета;
		ЭтаФорма.мСкопированаФорма        		= Параметры.мСкопированаФорма;
		ЭтаФорма.мСохраненныйДок          		= Параметры.мСохраненныйДок;
		
		СчетДоверительногоУправленияПриИзмененииНаСервере();
		ЗаполнитьВидДеятельностиИФормуОрганизации(ЭтаФорма);
		
	КонецЕсли;	
	
	ЭтаФормаИмя = Строка(ЭтаФорма.ИмяФормы);
	ИсточникОтчета = КонсолидированнаяОтчетность.ИсточникОтчета(ЭтаФормаИмя);
	ЗначениеВДанныеФормы(Отчеты[ИсточникОтчета].ТаблицаФормОтчета(), мТаблицаФормОтчета);
	
	Элементы.ПолеРедакцияФормы.Видимость = НЕ (мТаблицаФормОтчета.Количество() > 1);
	
	Если мДатаКонцаПериодаОтчета <> Неопределено И НЕ ЭтаФорма.НестандартныйПериод Тогда
		ИзменитьПериод(ЭтаФорма, 0);
	КонецЕсли;
	
	ОткорректироватьНачальныйПериод(ЭтаФорма.Организация);
	
	ЭтаФорма.ОрганизацияДатаРегистрации = ЭтаФорма.Организация.ДатаНачалаУчета;
	
	Если ЗначениеЗаполнено(ЭтаФорма.мСохраненныйДок) Тогда
		СохраненныеДанныеОтчета = ЭтаФорма.мСохраненныйДок.ДанныеОтчета.Получить();
		
		Если СохраненныеДанныеОтчета.Свойство("ВидДеятельностиОрганизации") Тогда 
			ЭтаФорма.ВидДеятельностиОрганизации = СохраненныеДанныеОтчета.ВидДеятельностиОрганизации;
		КонецЕсли;
		
		Если СохраненныеДанныеОтчета.Свойство("НКО") Тогда 
			ЭтаФорма.НКО = СохраненныеДанныеОтчета.НКО;
		КонецЕсли;
		
		УстановитьПереключательВидаДеятельностиИФормыОрганизации(ЭтаФорма);
	КонецЕсли;	
	
	КонсолидированнаяОтчетностьКлиентСервер.ПоказатьПериод(ЭтаФорма, ОрганизацияДатаРегистрации);
	
	УстановитьДоступностьКнопокПериода(ЭтаФорма, ОрганизацияДатаРегистрации);

КонецПроцедуры

&НаКлиенте
Процедура ПолеРедакцияФормыПриИзменении(Элемент)
	
	СтрРедакцияФормы = ПолеРедакцияФормы;
	// Ищем в таблице мТаблицаФормОтчета для определения выбранной формы отчета.
	ЗаписьПоиска = Новый Структура;
	ЗаписьПоиска.Вставить("РедакцияФормы",СтрРедакцияФормы);
	МассивСтрок = мТаблицаФормОтчета.НайтиСтроки(ЗаписьПоиска);
	
	Если МассивСтрок.Количество() > 0 Тогда
		ВыбраннаяФорма = МассивСтрок[0];
		// Присваиваем.
		мВыбраннаяФорма     = ВыбраннаяФорма.ФормаОтчета;
		ОписаниеНормативДок = ВыбраннаяФорма.ОписаниеОтчета;
	КонецЕсли;
	УстановитьПризнакПереходаМСФО9(ЭтаФорма);
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПредыдущийПериод(Команда)
	
	ИзменитьПериод(ЭтаФорма, -1);
	
	ВидПериода = КонсолидированнаяОтчетностьКлиентСервер.ВидПериодаОтчета(ЭтаФорма, ОрганизацияДатаРегистрации);
	Если ВидПериода <> "Стандартный" Тогда
		мДатаНачалаПериодаОтчета = ОрганизацияДатаРегистрации;
	КонецЕсли;
	
	КонсолидированнаяОтчетностьКлиентСервер.ПоказатьПериод(ЭтаФорма, ОрганизацияДатаРегистрации);
	
	УстановитьДоступностьКнопокПериода(ЭтаФорма, ОрганизацияДатаРегистрации);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСледующийПериод(Команда)
	
	ИзменитьПериод(ЭтаФорма, 1);
	
	ВидПериода = КонсолидированнаяОтчетностьКлиентСервер.ВидПериодаОтчета(ЭтаФорма, ОрганизацияДатаРегистрации);
	Если ВидПериода <> "Стандартный" Тогда
		мДатаНачалаПериодаОтчета = ОрганизацияДатаРегистрации;
	КонецЕсли;
	
	КонсолидированнаяОтчетностьКлиентСервер.ПоказатьПериод(ЭтаФорма, ОрганизацияДатаРегистрации);
	
	УстановитьДоступностьКнопокПериода(ЭтаФорма, ОрганизацияДатаРегистрации); 
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПризнакПереходаМСФО9(Форма)
	
	Если Форма.МСФО9 
		И Форма.мДатаКонцаПериодаОтчета = КонецДня('20241231')
		И Форма.мВыбраннаяФорма = "ФормаОтчета_МСФО9_2025" 
		И Форма.ПолеРедакцияФормы = "от 29 июня 2020 года № 727-П (МСФО 9, АО)" Тогда
		Если ПолучитьВариантУчетаСтоимостиИОбесцененияФинансовыхАктивов(Форма.Организация, Форма.СчетДоверительногоУправления, Форма.мДатаКонцаПериодаОтчета) = ПредопределенноеЗначение("Перечисление.СтандартыФинансовойОтчетности.МСФО39") Тогда 
			Форма.ПереходНаМСФО9 = Истина;
		Иначе
			Форма.ПереходНаМСФО9 = Ложь;
		КонецЕсли;
		Форма.Элементы.ПереходНаМСФО9.Доступность = Истина;
		Форма.Элементы.ПереходНаМСФО9.Видимость = Истина; 
	ИначеЕсли Форма.МСФО9 
		И Форма.мДатаКонцаПериодаОтчета = КонецДня('20241231')
		И Форма.мВыбраннаяФорма = "ФормаОтчета_МСФО9_СК_2025" Тогда
		Форма.ПереходНаМСФО9 = Истина;
		Форма.Элементы.ПереходНаМСФО9.Доступность = Истина;
		Форма.Элементы.ПереходНаМСФО9.Видимость = Истина; 
	Иначе
		Форма.ПереходНаМСФО9 = Ложь;
		Форма.Элементы.ПереходНаМСФО9.Доступность = Ложь;
		Форма.Элементы.ПереходНаМСФО9.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
	
	СчетДоверительногоУправленияПриИзмененииНаСервере();
	
	ЭтаФорма.НестандартныйПериод = Ложь;
	НестандартныйПериодПриИзменении(ЭтаФорма.Элементы.НестандартныйПериод);
	
	КонсолидированнаяОтчетностьКлиентСервер.ПоказатьПериод(ЭтаФорма, ОрганизацияДатаРегистрации);
	
КонецПроцедуры

&НаСервере
Процедура СчетДоверительногоУправленияПриИзмененииНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.ОрганизационноПравоваяФорма
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&Период, СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(&Период, Организация = &Организация И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицАнкетныеСрезПоследних
		|		ПО КлиентыДоверительногоУправленияСрезПоследних.Клиент = РеквизитыЮридическихЛицАнкетныеСрезПоследних.ЮрФизЛицо";
		
	Запрос.УстановитьПараметр("Период",    ЭтаФорма.мДатаКонцаПериодаОтчета);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтаФорма.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Организация", ЭтаФорма.Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
	
		Если Выборка.ОрганизационноПравоваяФорма = Справочники.ОрганизационноПравовыеФормы.ЗакрытоеАкционерноеОбщество Или 
			Выборка.ОрганизационноПравоваяФорма = Справочники.ОрганизационноПравовыеФормы.НепубличноеАкционерноеОбщество Или 
			Выборка.ОрганизационноПравоваяФорма = Справочники.ОрганизационноПравовыеФормы.ОткрытоеАкционерноеОбщество Или 
			Выборка.ОрганизационноПравоваяФорма = Справочники.ОрганизационноПравовыеФормы.ПубличноеАкционерноеОбщество Тогда
			
			ПереключательВидДеятельностиИФормаОрганизации = 0;
			
		Иначе
			
			ПереключательВидДеятельностиИФормаОрганизации = 1;
		
		КонецЕсли; 
		
		ЗаполнитьВидДеятельностиИФормуОрганизации(ЭтаФорма);
	КонецЕсли; 
	
	//Получить МСФО из настроек
		
КонецПроцедуры

&НаКлиенте
Процедура ПереключательВидДеятельностиИФормаОрганизацииПриИзменении(Элемент)
	
	ЗаполнитьВидДеятельностиИФормуОрганизации(ЭтаФорма);
	
	КонсолидированнаяОтчетностьКлиентСервер.ПоказатьПериод(ЭтаФорма, ОрганизацияДатаРегистрации);
	УстановитьПризнакПереходаМСФО9(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьВидДеятельностиИФормуОрганизации(ЭтаФорма)
	
	ЭтаФорма.ВидДеятельностиОрганизации	= ?(ЭтаФорма.ПереключательВидДеятельностиИФормаОрганизации < 2, "НПФ", "СК"); 
	ЭтаФорма.НКО						= (ЭтаФорма.ПереключательВидДеятельностиИФормаОрганизации = 1);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПереключательВидаДеятельностиИФормыОрганизации(ЭтаФорма)
	
	ЭтаФорма.ПереключательВидДеятельностиИФормаОрганизации = ?(ЭтаФорма.ВидДеятельностиОрганизации = "СК", 2, 0) + ?(ЭтаФорма.НКО, 1, 0);  	
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключательСтандартПриИзменении(Элемент)
	
	ЗаполнитьСтандарт(ЭтаФорма);
	
	КонсолидированнаяОтчетностьКлиентСервер.ПоказатьПериод(ЭтаФорма, ОрганизацияДатаРегистрации);
	УстановитьПризнакПереходаМСФО9(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьСтандарт(ЭтаФорма)
	
	ЭтаФорма.МСФО9 = (ЭтаФорма.ПереключательСтандарт = 1);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПереключательСтандарта(ЭтаФорма)
	
	ЭтаФорма.ПереключательСтандарт = ?(ЭтаФорма.МСФО9, 1, 0);  	
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуОтчета(Команда)
	
	Если мСкопированаФорма <> Неопределено Тогда
		// Документ был скопирован.
		// Проверяем соответствие форм.
		Если мВыбраннаяФорма <> мСкопированаФорма Тогда
			
			ПоказатьПредупреждение(,НСтр("ru='Форма отчета изменилась, копирование невозможно!'"));
			Возврат;
			
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЭтаФорма.СчетДоверительногоУправления) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Счет доверительного управления не заполнен", , "СчетДоверительногоУправления");
		Возврат;
		
	КонецЕсли;
	
	Если ЭтаФорма.НастройкиОтчета <> Неопределено
		И ЭтаФорма.НастройкиОтчета.Свойство("АвтоматическоеФормирование")
		И ЭтаФорма.НастройкиОтчета.АвтоматическоеФормирование
		И ЭтаФорма.НастройкиОтчета.Свойство("Период")
		И (ЭтаФорма.НастройкиОтчета.Период.ДатаНачала <> мДатаНачалаПериодаОтчета
			ИЛИ ЭтаФорма.НастройкиОтчета.Период.ДатаОкончания <> мДатаКонцаПериодаОтчета) Тогда
			
		НестандартныйПериод			= Истина;
		мДатаНачалаПериодаОтчета	= ЭтаФорма.НастройкиОтчета.Период.ДатаНачала;
		мДатаКонцаПериодаОтчета		= ЭтаФорма.НастройкиОтчета.Период.ДатаОкончания;
		
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("мДатаНачалаПериодаОтчета", 	мДатаНачалаПериодаОтчета);
	ПараметрыФормы.Вставить("мДатаКонцаПериодаОтчета",  	мДатаКонцаПериодаОтчета);
	ПараметрыФормы.Вставить("мСохраненныйДок",          	мСохраненныйДок);
	ПараметрыФормы.Вставить("мСкопированаФорма",        	мСкопированаФорма);
	ПараметрыФормы.Вставить("Организация",              	Организация);
	ПараметрыФормы.Вставить("СчетДоверительногоУправления", СчетДоверительногоУправления);
	ПараметрыФормы.Вставить("мВыбраннаяФорма",          	мВыбраннаяФорма);
	ПараметрыФормы.Вставить("мРедакцияФормы",				ПолеРедакцияФормы);	
	ПараметрыФормы.Вставить("ВидДеятельностиОрганизации",	ВидДеятельностиОрганизации);
	ПараметрыФормы.Вставить("НКО", 							НКО);
	ПараметрыФормы.Вставить("НестандартныйПериод",         	НестандартныйПериод);
	ПараметрыФормы.Вставить("ПереходНаМСФО9",         		ПереходНаМСФО9);
	
	ПараметрыФормы.Вставить("НастройкиОтчета",          	НастройкиОтчета);
	
	Если ТипЗнч(ЭтаФорма.НастройкиОтчета) = Тип("Структура") И ЭтаФорма.НастройкиОтчета.Свойство("АвтоматическоеФормирование") Тогда
		
		Сессия = ЗарегистрироватьНовуюСессию(ПараметрыФормы);
		
	    Форма = ПолучитьФорму(СтрЗаменить(ЭтаФорма.ИмяФормы, "ОсновнаяФорма", "") + мВыбраннаяФорма, ПараметрыФормы, , Истина);
		Форма.АвтоматическоеФормирование();
		Если ЭтаФорма.НастройкиОтчета.Свойство("ОткрытьФорму") Тогда
			Форма.Открыть();
		КонецЕсли;
		
		ЗафиксироватьОкончаниеСессии(Сессия);
		
	Иначе
		Форма = ОткрытьФорму(СтрЗаменить(ЭтаФорма.ИмяФормы, "ОсновнаяФорма", "") + мВыбраннаяФорма, ПараметрыФормы, , Истина);
	    Закрыть();
	КонецЕсли;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗарегистрироватьНовуюСессию(ПараметрыФормы)
		
	Описание = "";
	Для Каждого Параметр Из ПараметрыФормы Цикл
		
		Если Параметр.Ключ = "НастройкиОтчета" Тогда
			
			Если ТипЗнч(Параметр.Значение) = Тип("Структура") Тогда
			
				Для Каждого ПараметрНастроекОтчета Из Параметр.Значение Цикл
					Описание = Описание + ?(Описание = "", "", Символы.ПС) + ПараметрНастроекОтчета.Ключ + ": " + ПараметрНастроекОтчета.Значение;	
				КонецЦикла;
				
			КонецЕсли;
			
			Продолжить;
	
		КонецЕсли;
	
		Описание = Описание + ?(Описание = "", "", Символы.ПС) + Параметр.Ключ + ": " + Параметр.Значение;
	
	КонецЦикла; 
		
	Хранилище = Новый ХранилищеЗначения(ПараметрыФормы, Новый СжатиеДанных(9));
	
	Возврат РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(Метаданные.Отчеты.РегламентированныйОтчетБаланс.ПолноеИмя(), Хранилище, Описание);		
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗафиксироватьОкончаниеСессии(Сессия)
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Метаданные.Отчеты.РегламентированныйОтчетБаланс.ПолноеИмя(), Сессия);
		
КонецПроцедуры

&НаКлиенте 
Процедура АвтоматическоеФормирование() Экспорт

	ОткрытьФормуОтчета(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Функция СоздатьИЗаполнитьОтчет()
	
	Если НЕ ЗначениеЗаполнено(ЭтаФорма.СчетДоверительногоУправления) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Счет доверительного управления не заполнен", , "СчетДоверительногоУправления");
		Возврат Неопределено;
	КонецЕсли;
	
	Если ЭтаФорма.НастройкиОтчета.Свойство("Период")
		И (ЭтаФорма.НастройкиОтчета.Период.ДатаНачала <> мДатаНачалаПериодаОтчета
			ИЛИ ЭтаФорма.НастройкиОтчета.Период.ДатаОкончания <> мДатаКонцаПериодаОтчета) Тогда
		НестандартныйПериод			= Истина;
		мДатаНачалаПериодаОтчета	= ЭтаФорма.НастройкиОтчета.Период.ДатаНачала;
		мДатаКонцаПериодаОтчета		= ЭтаФорма.НастройкиОтчета.Период.ДатаОкончания;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("мДатаНачалаПериодаОтчета", 	мДатаНачалаПериодаОтчета);
	ПараметрыФормы.Вставить("мДатаКонцаПериодаОтчета",  	мДатаКонцаПериодаОтчета);
	ПараметрыФормы.Вставить("мСохраненныйДок",          	мСохраненныйДок);
	ПараметрыФормы.Вставить("мСкопированаФорма",        	мСкопированаФорма);
	ПараметрыФормы.Вставить("Организация",              	Организация);
	ПараметрыФормы.Вставить("СчетДоверительногоУправления", СчетДоверительногоУправления);
	ПараметрыФормы.Вставить("мВыбраннаяФорма",          	мВыбраннаяФорма);
	ПараметрыФормы.Вставить("мРедакцияФормы",				ПолеРедакцияФормы);	
	ПараметрыФормы.Вставить("ВидДеятельностиОрганизации",	ВидДеятельностиОрганизации);
	ПараметрыФормы.Вставить("НКО", 							НКО);
	ПараметрыФормы.Вставить("НестандартныйПериод",         	НестандартныйПериод);
	ПараметрыФормы.Вставить("НастройкиОтчета",          	НастройкиОтчета);
	ПараметрыФормы.Вставить("ПереходНаМСФО9", 				Ложь);
	
	Если мДатаКонцаПериодаОтчета = КонецДня('20241231') 
		И мВыбраннаяФорма = "ФормаОтчета_МСФО9_2025" 
		И ПолучитьВариантУчетаСтоимостиИОбесцененияФинансовыхАктивов(Организация, СчетДоверительногоУправления, мДатаКонцаПериодаОтчета) = ПредопределенноеЗначение("Перечисление.СтандартыФинансовойОтчетности.МСФО39") Тогда 
	    ПараметрыФормы.Вставить("ПереходНаМСФО9", Истина); 
	ИначеЕсли  мДатаКонцаПериодаОтчета = КонецДня('20241231') 
		И мВыбраннаяФорма = "ФормаОтчета_МСФО9_СК_2025" Тогда
	    ПараметрыФормы.Вставить("ПереходНаМСФО9", Истина); 
		//для автоматического создания отчетов за прошлый период по новой форме
	КонецЕсли;
	
	Форма = ПолучитьФорму(СтрЗаменить(ЭтаФорма.ИмяФормы, "ОсновнаяФорма", "") + мВыбраннаяФорма, ПараметрыФормы, , Истина);
	
	Форма.Заполнить();
	
	Возврат Форма;
	
КонецФункции

&НаКлиенте
Процедура СоздатьИЗаписать() Экспорт
	
	Форма = СоздатьИЗаполнитьОтчет();
	
	Если Форма <> Неопределено Тогда
		Форма.СохранитьНаКлиенте();
		мСохраненныйДок = Форма.СтруктураРеквизитовФормы.мСохраненныйДок;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьФорму() Экспорт
	
	Форма = СоздатьИЗаполнитьОтчет();
	
	Если Форма <> Неопределено Тогда
		Форма.Открыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокПериодовСУчетомРеформаций()

	Возврат РегистрыСведений.РеформацииБалансов.ПолучитьСписокПериодовСУчетомРеформаций(
			ЭтаФорма.СчетДоверительногоУправления,
			НачалоГода(ЭтаФорма.мДатаНачалаПериодаОтчета),
			КонецГода(ЭтаФорма.мДатаКонцаПериодаОтчета));

КонецФункции 

&НаКлиенте
Процедура НестандартныйПериодПриИзменении(Элемент)
	
	Если ЭтаФорма.НестандартныйПериод Тогда
	
		СписокВыбора = ПолучитьСписокПериодовСУчетомРеформаций();
		
		ЭтаФорма.Элементы.ПолеПериодРеформации.СписокВыбора.Очистить();
		
		Для каждого ЭлементСписокВыбора Из СписокВыбора Цикл
			ЗаполнитьЗначенияСвойств(ЭтаФорма.Элементы.ПолеПериодРеформации.СписокВыбора.Добавить(), ЭлементСписокВыбора);
		КонецЦикла; 		
		
	Иначе
		
		ЭтаФорма.мДатаНачалаПериодаОтчета = Неопределено;
		ЭтаФорма.мДатаКонцаПериодаОтчета = Неопределено;
		ОткорректироватьНачальныйПериод(ЭтаФорма.Организация);
		КонсолидированнаяОтчетностьКлиентСервер.ПоказатьПериод(ЭтаФорма, ОрганизацияДатаРегистрации);
		
	КонецЕсли;
	
	ЭтаФорма.Элементы.ПолеПериодРеформации.Доступность = ЭтаФорма.НестандартныйПериод;
	ЭтаФорма.Элементы.ПолеНестандартногоПериода.Доступность = ЭтаФорма.НестандартныйПериод;
	
	УстановитьДоступностьКнопокПериода(ЭтаФорма, ЭтаФорма.ОрганизацияДатаРегистрации);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеПериодРеформацииПриИзменении(Элемент)
	
	ЭтаФорма.мДатаНачалаПериодаОтчета = ЭтаФорма.ПолеПериодРеформации.НачалоПериода;
	ЭтаФорма.мДатаКонцаПериодаОтчета = ЭтаФорма.ПолеПериодРеформации.КонецПериода;
	
	ЭтаФорма.ПолеНестандартногоПериода.ДатаНачала = ЭтаФорма.ПолеПериодРеформации.НачалоПериода;
	ЭтаФорма.ПолеНестандартногоПериода.ДатаОкончания = ЭтаФорма.ПолеПериодРеформации.КонецПериода;
	
	КонсолидированнаяОтчетностьКлиентСервер.ПоказатьПериод(ЭтаФорма, ОрганизацияДатаРегистрации);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеНестандартногоПериодаПриИзменении(Элемент)
	
	ЭтаФорма.мДатаНачалаПериодаОтчета = ЭтаФорма.ПолеНестандартногоПериода.ДатаНачала;
	ЭтаФорма.мДатаКонцаПериодаОтчета = ЭтаФорма.ПолеНестандартногоПериода.ДатаОкончания;
	
	КонсолидированнаяОтчетностьКлиентСервер.ПоказатьПериод(ЭтаФорма, ОрганизацияДатаРегистрации);
	
КонецПроцедуры
